Revit 2027 API
Rebar.RemoveSplice Method
 Removes the splice relation at the specified end and all the Rebar Constraints involved in splice.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSplice(
	int barEnd
)
Public Sub RemoveSplice (
	barEnd As Integer
)
public:
void RemoveSplice(
	int barEnd
)
member RemoveSplice :
        barEnd : int -> unit
Parameters
barEnd Int32
 The end where the splice is to be removed - 0 for start, 1 for end.
Exceptions
Exception | Condition
ArgumentException |  There is no splice at the specified end.
ArgumentOutOfRangeException |  barEnd must be 0 or 1.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace